# 1. Існують такі послідовності чисел:
# 0,2,4,6,8,10,12
# 1,4,7,10,13
# 1,2,4,8,16,32
# 1,3,9,27
# 1,4,9,16,25
# 1,8,27,64,125
# Реалізуйте програму, яка виведе наступний член цієї послідовності (або подібної до них) на екран.
# Послідовність користувач вводить з клавіатури у вигляді рядка. Наприклад, користувач вводить
# рядок 0,5,10,15,20,25 та відповіддю програми має бути число 30.


# 2. Число-паліндром з обох сторін (справа ліворуч і ліворуч) читається однаково.
# Найбільше число-паліндром, одержане множенням двох двозначних чисел: 9009 = 91 × 99.
# Знайдіть найбільший паліндром, одержаний множенням двох трицифрових чисел.
# Виведіть значення цього паліндрому і те, множенням яких чисел він є.
def f2():
    for i in range (999_999, 100_000, -1):
        if str(i)[:3] == str(i)[-1:-4:-1]:
            for j in range (999, 100, -1):
                if not i%j and len(str(int(i/j))) == 3:
                    return f'Max 6-digit palindrome: {i}\nMultipliers: {j}, {int(i/j)}'

print (f2())
